Table of Contents
 Class CrossSectionFactory
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
CrossSectionFactory
public static class CrossSectionFactory
Inheritance
object
CrossSectionFactory
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Methods
 FillBox2(CrossSectionParameter, double, double, double, double, double, double, double)
[Obsolete("Use FillWeldedBoxFlange instead")]
public static void FillBox2(CrossSectionParameter css, double bu, double bb, double hw, double b1, double tw, double tfu, double tfb)
Parameters
css CrossSectionParameter
bu double
bb double
hw double
b1 double
tw double
tfu double
tfb double
 FillBoxWeb(CrossSectionParameter, double, double, double, double, double, double, double, bool)
[Obsolete("Use FillWeldedBoxWeb instead")]
public static void FillBoxWeb(CrossSectionParameter css, double bu, double bb, double hw, double b1, double tw, double tfu, double tfb, bool mirrorY = false)
Parameters
css CrossSectionParameter
bu double
bb double
hw double
b1 double
tw double
tfu double
tfb double
mirrorY bool
 FillBoxWeb(CrossSectionParameter, double, double, double, double, double, double, double, double, double, BoxDeltaAligment, bool)
[Obsolete("Use FillWeldedBoxDelta instead")]
public static void FillBoxWeb(CrossSectionParameter css, double bu, double bb, double hw, double b1, double h, double tw, double tfu, double tfb, double overlap, BoxDeltaAligment aligment, bool mirrorY = false)
Parameters
css CrossSectionParameter
bu double
bb double
hw double
b1 double
h double
tw double
tfu double
tfb double
overlap double
aligment BoxDeltaAligment
mirrorY bool
 FillCHSPar(CrossSectionParameter, double, double)
[Obsolete("Use FillRolledCHS instead")]
public static void FillCHSPar(CrossSectionParameter css, double D, double t)
Parameters
css CrossSectionParameter
D double
t double
 FillCircle(CrossSectionParameter, double)
Circular shape - for steel or concrete shape
public static void FillCircle(CrossSectionParameter css, double d)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
d double
Diametrer of the shape
 FillColdFormedC(CrossSectionParameter, double, double, double, double, double, bool)
Fill parameters for cold formed C section
public static void FillColdFormedC(CrossSectionParameter css, double Width, double Height, double Thickness, double Radius, double lip, bool mirrorZ = false)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Width double
Css width
Height double
Height of cross-section
Thickness double
Thickness
Radius double
Inside radius
lip double
Lip length
mirrorZ bool
 FillColdFormedChannel(CrossSectionParameter, double, double, double, double, bool)
Fill parameters for cold formed C channel
public static void FillColdFormedChannel(CrossSectionParameter css, double Width, double Height, double Thickness, double Radius, bool mirrorZ = false)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Width double
Css width
Height double
Height of cross-section
Thickness double
Thickness
Radius double
Inside radius
mirrorZ bool
 FillColdFormedCp(CrossSectionParameter, double, double, double, double, double, double, double, bool)
Cold-formed C+ section
public static void FillColdFormedCp(CrossSectionParameter css, double width, double height, double thickness, double radius, double lip, double lip2, double lip2Angle, bool mirrorZ = false)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
width double
Width
height double
Height
thickness double
Thickness
radius double
Inner radius
lip double
Lenght of the first lip
lip2 double
Lenght of the second lip
lip2Angle double
Angle between lips
mirrorZ bool
 FillColdFormedGeneral(CrossSectionGeneralColdFormed, Region2D, double, double)
Fill center line for general cold formed css
public static void FillColdFormedGeneral(CrossSectionGeneralColdFormed gcf, Region2D region2D, double Thickness, double InsideRadius)
Parameters
gcf CrossSectionGeneralColdFormed
region2D Region2D
We need PolyLine2D from region2D
Thickness double
Thickness
InsideRadius double
Inside radius
 FillColdFormedL(CrossSectionParameter, double, double, double, double, bool, bool)
Fill parameters for cold formed L section
public static void FillColdFormedL(CrossSectionParameter css, double Width, double Height, double Thickness, double Radius, bool mirrorY = false, bool mirrorZ = false)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Width double
Horizontal leg length
Height double
Vertical leg length
Thickness double
Thickness
Radius double
Inside radius
mirrorY bool
mirrorZ bool
 FillColdFormedLgen(CrossSectionParameter, double, double, double, double, double, bool, bool)
Fill parameters for cold formed L - gen section
public static void FillColdFormedLgen(CrossSectionParameter css, double Width, double Height, double Angle, double Thickness, double Radius, bool mirrorY = false, bool mirrorZ = false)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Width double
Horizontal leg length
Height double
Vertical leg length
Angle double
Angle between legs
Thickness double
Thickness
Radius double
Inside radius
mirrorY bool
mirrorZ bool
 FillColdFormedOmega(CrossSectionParameter, double, double, double, double, double, bool)
Fill parameters for cold formed Omega section
public static void FillColdFormedOmega(CrossSectionParameter css, double Width, double Height, double FlangeWidth, double Thickness, double Radius, bool mirrorY = false)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Width double
Css width
Height double
Height of cross-section
FlangeWidth double
Flange width
Thickness double
Thickness
Radius double
Inside radius
mirrorY bool
 FillColdFormedRHS(CrossSectionParameter, double, double, double, double)
Fill parameters for cold formed RHS section
public static void FillColdFormedRHS(CrossSectionParameter css, double Height, double Width, double Thickness, double InsideRadius)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Height double
Height
Width double
Width
Thickness double
Thickness
InsideRadius double
Inside radius
 FillColdFormedRegularPolygon(CrossSectionParameter, double, int, double, double)
Fill parameters for cold formed Regular polygon section
public static void FillColdFormedRegularPolygon(CrossSectionParameter css, double Radius, int Number, double Thickness, double InsideRadius)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Radius double
Radius
Number int
Number
Thickness double
Thickness
InsideRadius double
Inside radius
 FillColdFormedSigma(CrossSectionParameter, double, double, double, double, double, double, double, double, bool)
Fill parameters for cold formed sigma section
public static void FillColdFormedSigma(CrossSectionParameter css, double Height, double Width, double Lip, double Thickness, double InsideRadius, double HeightMiddle, double HeightEdge, double Depth, bool mirrorZ = false)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Height double
Height
Width double
Width
Lip double
Length of lip
Thickness double
Thickness
InsideRadius double
Inside radius
HeightMiddle double
Height of middle part
HeightEdge double
Height of edge part
Depth double
Depth of web-fold
mirrorZ bool
 FillColdFormedZ(CrossSectionParameter, double, double, double, double, bool)
Fill parameters for cold formed Z section
public static void FillColdFormedZ(CrossSectionParameter css, double Width, double Height, double Thickness, double Radius, bool mirrorZ = false)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Width double
Css width
Height double
Height of cross-section
Thickness double
Thickness
Radius double
Inside radius
mirrorZ bool
 FillColdFormedZed(CrossSectionParameter, double, double, double, double, double, bool)
Fill parameters for cold formed Z-ed section
public static void FillColdFormedZed(CrossSectionParameter css, double Width, double Height, double Thickness, double Radius, double Lip, bool mirrorZ = false)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Width double
Css width
Height double
Height of cross-section
Thickness double
Thickness
Radius double
Inside radius
Lip double
Lip length
mirrorZ bool
 FillComposedDblLt(CrossSectionParameter, double, double, double, double, bool, bool)
Creates a new L shape css
public static void FillComposedDblLt(CrossSectionParameter css, double h, double b, double th, double distance, bool shortLegUp = false, bool mirrorY = false)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
h double
The height of css.
b double
The width of css.
th double
Thickness
distance double
Distance between
shortLegUp bool
mirrorY bool
 FillComposedDblLt(CrossSectionParameter, double, double, double, double, double, bool, bool)
[Obsolete("Argument 'sh' is ignored")]
public static void FillComposedDblLt(CrossSectionParameter css, double h, double b, double th, double sh, double dis, bool shortLegUp = false, bool mirrorY = false)
Parameters
css CrossSectionParameter
h double
b double
th double
sh double
dis double
shortLegUp bool
mirrorY bool
 FillComposedDblLt(CrossSectionParameter, string, double, bool, bool)
Fill steel section Lt shape
public static void FillComposedDblLt(CrossSectionParameter css, string name, double distance, bool shortLegUp = false, bool mirrorY = false)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
name string
Name
distance double
Distance
shortLegUp bool
mirrorY bool
 FillComposedDblLu(CrossSectionParameter, double, double, double, double, bool, bool)
Creates a new L shape css.
public static void FillComposedDblLu(CrossSectionParameter css, double h, double b, double th, double distance, bool shortLegUp = false, bool mirrorY = false)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
h double
The height of css.
b double
The width of css.
th double
Thickness
distance double
Distance between
shortLegUp bool
mirrorY bool
 FillComposedDblLu(CrossSectionParameter, double, double, double, double, double, bool, bool)
[Obsolete("Argument 'sh' is ignored")]
public static void FillComposedDblLu(CrossSectionParameter css, double h, double b, double th, double sh, double dis, bool shortLegUp = false, bool mirrorY = false)
Parameters
css CrossSectionParameter
h double
b double
th double
sh double
dis double
shortLegUp bool
mirrorY bool
 FillComposedDblLu(CrossSectionParameter, string, double, bool, bool)
Fill steel section Lu shape
public static void FillComposedDblLu(CrossSectionParameter css, string name, double distance, bool shortLegUp = false, bool mirrorY = false)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
name string
Name
distance double
Distance
shortLegUp bool
mirrorY bool
 FillComposedDblUc(CrossSectionParameter, string, double)
Fills a double channel steel section. They form a closed/back-to-back [] shape.
public static void FillComposedDblUc(CrossSectionParameter css, string name, double distance)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
name string
Name
distance double
Distance
 FillComposedDblUo(CrossSectionParameter, double, double, double, double, double)
Fills a double channel steel section. They form an open/front-to-front ][ shape.
public static void FillComposedDblUo(CrossSectionParameter css, double b, double h, double tw, double th, double distance)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
b double
The width of css
h double
The height of css
tw double
Web thickness
th double
Flange thickness
distance double
Distance between ][
 FillComposedDblUo(CrossSectionParameter, double, double, double, double, double, double, double)
[Obsolete("Arguments 'bb' and 'tr' are ignored")]
public static void FillComposedDblUo(CrossSectionParameter css, double bt, double bb, double h, double tb, double tl, double tr, double dis)
Parameters
css CrossSectionParameter
bt double
bb double
h double
tb double
tl double
tr double
dis double
 FillComposedDblUo(CrossSectionParameter, string, double)
Fills a double channel steel section. They form an open/front-to-front ][ shape.
public static void FillComposedDblUo(CrossSectionParameter css, string name, double distance)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
name string
Name
distance double
Distance
 FillCssIarc(CrossSectionParameter, double, double, double, double, double, double, double)
[Obsolete("Use FillRolledI instead")]
public static void FillCssIarc(CrossSectionParameter css, double B, double H, double S, double T, double R2, double tapperF, double r1)
Parameters
css CrossSectionParameter
B double
H double
S double
T double
R2 double
tapperF double
r1 double
 FillCssRectangleHollow(CrossSectionParameter, double, double, double, double, double, double)
Fill cross-section of shape rectangular for concrete sections
public static void FillCssRectangleHollow(CrossSectionParameter css, double width, double height, double thickLeft, double thickRight, double thickTop, double thickBottom)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
width double
The width of css.
height double
The height of css.
thickLeft double
The thickness at the left side.
thickRight double
The thickness at the rigth side.
thickTop double
The thickness at the top.
thickBottom double
The thickness at the bottom.
 FillCssSteelAngle(CrossSectionParameter, double, double, double, double, double, double, bool)
[Obsolete("Use FillRolledAngle instead")]
public static void FillCssSteelAngle(CrossSectionParameter css, double B, double D, double t, double rw, double r2, double C, bool mirrorZ = false)
Parameters
css CrossSectionParameter
B double
D double
t double
rw double
r2 double
C double
mirrorZ bool
 FillCssSteelChannel(CrossSectionParameter, double, double, double, double, double, double, double)
[Obsolete("Use FillRolledChannel instead")]
public static void FillCssSteelChannel(CrossSectionParameter css, double B, double D, double tw, double tf, double rw, double rf, double taperF)
Parameters
css CrossSectionParameter
B double
D double
tw double
tf double
rw double
rf double
taperF double
 FillCssSteelCircularHollow(CrossSectionParameter, double, double)
[Obsolete("Use FillRolledCHS instead")]
public static void FillCssSteelCircularHollow(CrossSectionParameter css, double r, double t)
Parameters
css CrossSectionParameter
r double
t double
 FillCssSteelRectangularHollow(CrossSectionParameter, double, double, double, double, double, double)
[Obsolete("Use FillRolledRHS instead")]
public static void FillCssSteelRectangularHollow(CrossSectionParameter css, double D, double B, double t, double r1, double r2, double d)
Parameters
css CrossSectionParameter
D double
B double
t double
r1 double
r2 double
d double
 FillCssTarc(CrossSectionParameter, double, double, double, double, double, double, double, double, double, bool)
[Obsolete("Use FillRolledT instead")]
public static void FillCssTarc(CrossSectionParameter css, double B, double H, double Tw, double Tf, double R, double R1, double R2, double tapperF, double tapperW, bool mirrorY = false)
Parameters
css CrossSectionParameter
B double
H double
Tw double
Tf double
R double
R1 double
R2 double
tapperF double
tapperW double
mirrorY bool
 FillGeneralShape(CrossSectionParameter, double, double, double, double, double, double)
Fill general shape
public static void FillGeneralShape(CrossSectionParameter css, double pt0, double pt1, double pt2, double pt3, double pt4, double pt5)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
pt0 double
Cross-section point 0
pt1 double
Cross-section point 1
pt2 double
Cross-section point 2
pt3 double
Cross-section point 3
pt4 double
Cross-section point 4
pt5 double
Cross-section point 5
 FillLibraryShape(CrossSectionParameter, string)
public static void FillLibraryShape(CrossSectionParameter css, string searchName)
Parameters
css CrossSectionParameter
searchName string
 FillOHollow(CrossSectionParameter, double, double)
Fill massive pipe shape
public static void FillOHollow(CrossSectionParameter css, double r, double t)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
r double
The radius of circle.
t double
The thickness of wall.
 FillRectangle(CrossSectionParameter, double, double)
Rectangle shape - massive concrete shape
public static void FillRectangle(CrossSectionParameter css, double width, double height)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
width double
Width of the rectangle
height double
Height of the rectangle
 FillRolledAngle(CrossSectionParameter, double, double, double, double, double, double, bool, bool)
Rolled steel angle
public static void FillRolledAngle(CrossSectionParameter css, double B, double D, double t, double rw, double r2, double C, bool mirrorZ = false, bool mirrorY = false)
Parameters
css CrossSectionParameter
CrossSectionParameter to fill
B double
Width
D double
Depth
t double
Thickness
rw double
Root radius
r2 double
Toe radius
C double
Centroid position
mirrorZ bool
Z-axis mirror
mirrorY bool
Y-axis mirror
 FillRolledAngle(CrossSectionParameter, string, bool, bool)
public static void FillRolledAngle(CrossSectionParameter css, string name, bool mirrorZ = false, bool mirrorY = false)
Parameters
css CrossSectionParameter
name string
mirrorZ bool
mirrorY bool
 FillRolledCHS(CrossSectionParameter, double, double)
Steel circular hollow section
public static void FillRolledCHS(CrossSectionParameter css, double r, double t)
Parameters
css CrossSectionParameter
CrossSectionParameter to fill
r double
Radius
t double
Thickness
 FillRolledCHS(CrossSectionParameter, string)
public static void FillRolledCHS(CrossSectionParameter css, string name)
Parameters
css CrossSectionParameter
name string
 FillRolledChannel(CrossSectionParameter, double, double, double, double, double, double, double, bool)
Rolled steel channel
public static void FillRolledChannel(CrossSectionParameter css, double B, double D, double tw, double tf, double rw, double rf, double taperF, bool mirrorZ = false)
Parameters
css CrossSectionParameter
CrossSectionParameter to fill
B double
Width
D double
Depth
tw double
Web thickness
tf double
Flange thickness
rw double
Root radius
rf double
Flange edge radius
taperF double
Flange taper
mirrorZ bool
 FillRolledChannel(CrossSectionParameter, string, bool)
public static void FillRolledChannel(CrossSectionParameter css, string name, bool mirrorZ = false)
Parameters
css CrossSectionParameter
name string
mirrorZ bool
 FillRolledI(CrossSectionParameter, double, double, double, double, double, double, double)
Rolled steel I section
public static void FillRolledI(CrossSectionParameter css, double b, double h, double s, double t, double r2, double tapperF, double r1)
Parameters
css CrossSectionParameter
CrossSectionParameter to fill
b double
Width
h double
Height
s double
Web thickness
t double
Flange thickness
r2 double
Inside radius
tapperF double
Flange tapper
r1 double
Flange edge rounding radius
 FillRolledI(CrossSectionParameter, string)
public static void FillRolledI(CrossSectionParameter css, string name)
Parameters
css CrossSectionParameter
name string
 FillRolledRHS(CrossSectionParameter, double, double, double, double, double, double)
Steel rectangular hollow section
public static void FillRolledRHS(CrossSectionParameter css, double D, double B, double t, double r1, double r2, double d)
Parameters
css CrossSectionParameter
CrossSectionParameter to fill
D double
depth
B double
width
t double
thickness
r1 double
inner radius
r2 double
outer radius
d double
web buckling depth
 FillRolledRHS(CrossSectionParameter, string)
public static void FillRolledRHS(CrossSectionParameter css, string name)
Parameters
css CrossSectionParameter
name string
 FillRolledT(CrossSectionParameter, double, double, double, double, double, double, double, double, double, bool)
Rolled steel T section
public static void FillRolledT(CrossSectionParameter css, double B, double H, double Tw, double Tf, double R, double R1, double R2, double tapperF, double tapperW, bool mirrorY = false)
Parameters
css CrossSectionParameter
CrossSectionParameter to fill
B double
Width
H double
Height
Tw double
Web thickness
Tf double
Flange thickness
R double
Inside radius
R1 double
Flange edge rounding radius
R2 double
Web edge rounding radius
tapperF double
Flange tapper
tapperW double
Web tapper
mirrorY bool
Y-axis mirror
 FillRolledT(CrossSectionParameter, string, bool)
public static void FillRolledT(CrossSectionParameter css, string name, bool mirrorY = false)
Parameters
css CrossSectionParameter
name string
mirrorY bool
 FillRolledTFromI(CrossSectionParameter, string, double, bool)
Rolled steel T section (I-cut)
public static void FillRolledTFromI(CrossSectionParameter css, string name, double H, bool mirrorY = false)
Parameters
css CrossSectionParameter
CrossSectionParameter to fill
name string
Name
H double
Height
mirrorY bool
Y-axis mirror
 FillShapeDblL(CrossSectionParameter, double, double, double, double, double, bool, bool)
[Obsolete("Use FillComposedDblLt instead")]
public static void FillShapeDblL(CrossSectionParameter css, double h, double b, double th, double sh, double dis, bool shortLegUp = false, bool mirrorY = false)
Parameters
css CrossSectionParameter
h double
b double
th double
sh double
dis double
shortLegUp bool
mirrorY bool
 FillShapeDblLu(CrossSectionParameter, double, double, double, double, double, bool, bool)
[Obsolete("Use FillComposedDblLu instead")]
public static void FillShapeDblLu(CrossSectionParameter css, double h, double b, double th, double sh, double dis, bool shortLegUp = false, bool mirrorY = false)
Parameters
css CrossSectionParameter
h double
b double
th double
sh double
dis double
shortLegUp bool
mirrorY bool
 FillShapeDblU(CrossSectionParameter, double, double, double, double, double, double, double)
[Obsolete("Use FillComposedDblUo instead")]
public static void FillShapeDblU(CrossSectionParameter css, double bt, double bb, double h, double tb, double tl, double tr, double dis)
Parameters
css CrossSectionParameter
bt double
bb double
h double
tb double
tl double
tr double
dis double
 FillShapeI(CrossSectionParameter, double, double, double, double, double, double)
I shape - massive concrete shape
public static void FillShapeI(CrossSectionParameter css, double h, double btf, double bbf, double htf, double hbf, double tw)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
h double
Total height
btf double
Width of the upper part
bbf double
Width of the bottom part
htf double
Thickness of the upper part
hbf double
Thickness of the bottom part
tw double
Thinkness of the web
 FillShapeIBase(CrossSectionParameter, double, double, double, double, double, double, double, double)
I shape base - massive concrete shape
public static void FillShapeIBase(CrossSectionParameter css, double h, double btf, double bbf, double htf, double hbf, double tw, double htfh, double hbfh)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
h double
Total height
btf double
Width of the upper part
bbf double
Width of the bottom part
htf double
Thickness of the upper part
hbf double
Thickness of the bottom part
tw double
Thinkness of the web
htfh double
hbfh double
 FillShapeL(CrossSectionParameter, double, double, double, double)
Creates a new L shape css - massive concrete shape
public static void FillShapeL(CrossSectionParameter css, double h, double b, double th, double sh)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
h double
The height of css.
b double
The width of css.
th double
The bottom flange thisckness.
sh double
The wall thickness.
 FillShapeT(CrossSectionParameter, double, double, double, double)
T shape - massive concrete shape
public static void FillShapeT(CrossSectionParameter css, double b, double h, double hf, double bw)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
b double
Width of shape
h double
Height of shape
hf double
Top flange width
bw double
Wall width
 FillShapeTT(CrossSectionParameter, double, double, double, double, double)
TT shape - massive concrete shape
public static void FillShapeTT(CrossSectionParameter css, double b, double h, double hf, double bw, double s)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
b double
Width of shape
h double
Height of shape
hf double
Top flange width
bw double
Wall width
s double
Spacing
 FillShapeTrapezoid1(CrossSectionParameter, double, double, double)
Trapezoid shape
public static void FillShapeTrapezoid1(CrossSectionParameter css, double h, double bt, double bb)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
h double
Height of shape
bt double
Top width
bb double
Bottom width
 FillShapeTrev(CrossSectionParameter, double, double, double, double)
T turned shape - massive concrete shape
public static void FillShapeTrev(CrossSectionParameter css, double b, double h, double hf, double bw)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
b double
Width of shape
h double
Height of shape
hf double
Top flange width
bw double
Wall width
 FillShapeTrev1(CrossSectionParameter, double, double, double, double, double)
T turned shape - massive concrete shape
public static void FillShapeTrev1(CrossSectionParameter css, double b, double h, double hf, double bw, double hfh1)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
b double
Width of shape
h double
Height of shape
hf double
Top flange width
bw double
Wall width
hfh1 double
 FillShapeTwh(CrossSectionParameter, double, double, double, double, double)
T shape - massive concrete shape
public static void FillShapeTwh(CrossSectionParameter css, double b, double h, double hf, double bwT, double bwB)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
b double
Width of shape
h double
Height of shape
hf double
Flange thickness
bwT double
Web thickness top
bwB double
Web thickness bottom
 FillShapeU(CrossSectionParameter, double, double, double, double, double, double)
Creates a U shape of css.
public static void FillShapeU(CrossSectionParameter css, double bt, double bb, double h, double tb, double tl, double tr)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
bt double
The width of U top flange.
bb double
The width of U bottom flange.
h double
The height of U shape.
tb double
The bottom deck thickness.
tl double
The left deck thickness.
tr double
The right deck thickness.
 FillSteelTI(CrossSectionParameter, string, double, bool)
[Obsolete("Use FillRolledTFromI instead")]
public static void FillSteelTI(CrossSectionParameter css, string name, double H, bool mirrorY = false)
Parameters
css CrossSectionParameter
name string
H double
mirrorY bool
 FillSteelTube(CrossSectionParameter, double, double)
[Obsolete("Use FillRolledCHS instead")]
public static void FillSteelTube(CrossSectionParameter css, double r, double t)
Parameters
css CrossSectionParameter
r double
t double
 FillTriangle(CrossSectionParameter, double, double, double, double, double, bool)
[Obsolete("Use FillWeldedTriangle instead")]
public static void FillTriangle(CrossSectionParameter css, double h, double w, double fTh, double webTh, double webD, bool mirrorY = false)
Parameters
css CrossSectionParameter
h double
w double
fTh double
webTh double
webD double
mirrorY bool
 FillWelded2Lt(CrossSectionParameter, string, double, bool, bool)
[Obsolete("Use FillComposedDblLt instead")]
public static void FillWelded2Lt(CrossSectionParameter css, string name, double distance, bool shortLegUp = false, bool mirrorY = false)
Parameters
css CrossSectionParameter
name string
distance double
shortLegUp bool
mirrorY bool
 FillWelded2Lu(CrossSectionParameter, string, double, bool, bool)
[Obsolete("Use FillComposedDblLu instead")]
public static void FillWelded2Lu(CrossSectionParameter css, string name, double distance, bool shortLegUp = false, bool mirrorY = false)
Parameters
css CrossSectionParameter
name string
distance double
shortLegUp bool
mirrorY bool
 FillWelded2Uc(CrossSectionParameter, string, double)
[Obsolete("Use FillComposedDblUc instead")]
public static void FillWelded2Uc(CrossSectionParameter css, string name, double distance)
Parameters
css CrossSectionParameter
name string
distance double
 FillWeldedAsymI(CrossSectionParameter, double, double, double, double, double, double)
Welded I asymetrical - steel shape
public static void FillWeldedAsymI(CrossSectionParameter css, double bu, double bb, double hw, double tw, double tfu, double tfb)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
bu double
Width of upper flange
bb double
Width of bottom flange
hw double
Height of web
tw double
Web thickness
tfu double
Upper flange thickness
tfb double
Bottom flange thickness
 FillWeldedBoxDelta(CrossSectionParameter, double, double, double, double, double, double, double, double, double, BoxDeltaAligment, bool)
public static void FillWeldedBoxDelta(CrossSectionParameter css, double bu, double bb, double hw, double b1, double h, double tw, double tfu, double tfb, double overlap, BoxDeltaAligment aligment, bool mirrorY = false)
Parameters
css CrossSectionParameter
bu double
bb double
hw double
b1 double
h double
tw double
tfu double
tfb double
overlap double
aligment BoxDeltaAligment
mirrorY bool
 FillWeldedBoxFlange(CrossSectionParameter, double, double, double, double, double, double, double)
Box 2 - steel shape
public static void FillWeldedBoxFlange(CrossSectionParameter css, double bu, double bb, double hw, double b1, double tw, double tfu, double tfb)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
bu double
Width of upper flange
bb double
Width of bottom flange
hw double
Height of web
b1 double
Web distance
tw double
Web thickness
tfu double
Upper flange thickness
tfb double
Bottom flange thickness
 FillWeldedBoxWeb(CrossSectionParameter, double, double, double, double, double, double, double, bool)
public static void FillWeldedBoxWeb(CrossSectionParameter css, double bu, double bb, double hw, double b1, double tw, double tfu, double tfb, bool mirrorY = false)
Parameters
css CrossSectionParameter
bu double
bb double
hw double
b1 double
tw double
tfu double
tfb double
mirrorY bool
 FillWeldedI(CrossSectionParameter, double, double, double, double)
Fill steel section of welded I
public static void FillWeldedI(CrossSectionParameter css, double bu, double hw, double tw, double tf)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
bu double
Width of flange
hw double
Height of web
tw double
Web thickness
tf double
Flange thickness
 FillWeldedT(CrossSectionParameter, double, double, double, double, bool)
Fill steel section of welded T
public static void FillWeldedT(CrossSectionParameter css, double b, double h, double tw, double tf, bool mirrorY = false)
Parameters
css CrossSectionParameter
Parameters of CrossSectionParameter will be filled
b double
Width of flange
h double
Height of web
tw double
Web thickness
tf double
Flange thickness
mirrorY bool
 FillWeldedTriangle(CrossSectionParameter, double, double, double, double, double, bool)
public static void FillWeldedTriangle(CrossSectionParameter css, double h, double w, double fTh, double webTh, double webD, bool mirrorY = false)
Parameters
css CrossSectionParameter
h double
w double
fTh double
webTh double
webD double
mirrorY bool
 FillWeldedU(CrossSectionParameter, double, double, double, double, double, double, double, bool)
[Obsolete("Use FillRolledChannel instead")]
public static void FillWeldedU(CrossSectionParameter css, double b, double hw, double tw, double tf, double rw, double rf, double taperF, bool mirrorZ = false)
Parameters
css CrossSectionParameter
b double
hw double
tw double
tf double
rw double
rf double
taperF double
mirrorZ bool
 Edit this page